#### Terraform working directory 🏠: `demo/demo-account/demo-application/resources`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_ebs_volume.this["sda"] will be created
  + resource "aws_ebs_volume" "this" {
      + arn               = (known after apply)
      + availability_zone = "ap-southeast-1a"
      + encrypted         = true
      + final_snapshot    = false
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 40
      + snapshot_id       = (known after apply)
      + tags              = {
          + "Name" = "sda"
        }
      + tags_all          = {
          + "Name" = "sda"
        }
      + throughput        = (known after apply)
      + type              = "gp3"
    }

  # module.ec2_instances.module.ec2_instance["ansible-testhost5"].aws_volume_attachment.this["sda"] will be created
  + resource "aws_volume_attachment" "this" {
      + device_name = "sda"
      + id          = (known after apply)
      + instance_id = "i-0a6f3247805e75f3d"
      + volume_id   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
